<a href="https://colab.research.google.com/github/Sreenavya04/B19_1244-PDS-/blob/main/12_09_2025.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np
data={
    'Name':['srikanth','navs','chinni','pappa'],
    'Age':[25,np.nan,30,28],
    'Marks':[85,90,np.nan,92]
}
df=pd.DataFrame(data)
print("Orginal DataFrame:")
print(df)
#detect missing values
print(df.isnull())

Orginal DataFrame:
       Name   Age  Marks
0  srikanth  25.0   85.0
1      navs   NaN   90.0
2    chinni  30.0    NaN
3     pappa  28.0   92.0
    Name    Age  Marks
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [3]:
#drop rows and missing values
df_dropped=df.dropna()
print("After dropping rows with Nan")
print(df_dropped)

After dropping rows with Nan
       Name   Age  Marks
0  srikanth  25.0   85.0
3     pappa  28.0   92.0

In [5]:
df_filled=df.fillna(0)
print("filled with 0.")
print(df_filled)
df['Age']=df['Age'].fillna(df['Age'].mean())
df['Marks']=df['Marks'].fillna(df['Marks'].mean())

print(df)

filled with 0.
       Name   Age  Marks
0  srikanth  25.0   85.0
1      navs   0.0   90.0
2    chinni  30.0    0.0
3     pappa  28.0   92.0
       Name        Age  Marks
0  srikanth  25.000000   85.0
1      navs  27.666667   90.0
2    chinni  30.000000   89.0
3     pappa  28.000000   92.0

In [7]:
data={
    'ID':[1,2,3,4,],
    'Name':['srikanth','navs','chinni','pappa'],
    'Marks':[85,90,89,92]
}
df=pd.DataFrame(data)
print("Orginal DataFrame:")
print(df)
#remove duplicate
df_no_dup=df.drop_duplicates(subset='ID')
print("After removing duplicates:")
print(df_no_dup)

Orginal DataFrame:
   ID      Name  Marks
0   1  srikanth     85
1   2      navs     90
2   3    chinni     89
3   4     pappa     92
After removing duplicates:
   ID      Name  Marks
0   1  srikanth     85
1   2      navs     90
2   3    chinni     89
3   4     pappa     92

In [20]:
# data transformation
data={
    'ID':['1','2','3','4'],
    'Name':['srikanth','navs','chinni','pappa'],
    'Marks':[85,90,89,92] # Added Marks column
}
df=pd.DataFrame(data)
print("Original data types.")
print(df.dtypes)
#convert to numeric
df['ID']=pd.to_numeric(df['ID'])
print("After converting to numeric:")
print(df)
print(df.dtypes)
# applying functions
df['Marks']=df['Marks'].apply(lambda x:x+5)
print("After adding 5 marks to each student:")
print(df)
# Normalization
df['Marks_Normalized']=(df['Marks']-df['Marks'].min())/(df['Marks'].max()-df['Marks'].min()) # Corrected column name
print("After Normalization:")
print(df)

Original data types.
ID       object
Name     object
Marks     int64
dtype: object
After converting to numeric:
   ID      Name  Marks
0   1  srikanth     85
1   2      navs     90
2   3    chinni     89
3   4     pappa     92
ID        int64
Name     object
Marks     int64
dtype: object
After adding 5 marks to each student:
   ID      Name  Marks
0   1  srikanth     90
1   2      navs     95
2   3    chinni     94
3   4     pappa     97
After Normalization:
   ID      Name  Marks  Marks_Normalized
0   1  srikanth     90          0.000000
1   2      navs     95          0.714286
2   3    chinni     94          0.571429
3   4     pappa     97          1.000000

In [17]:
# data transformation
data={
    'ID':['1','2','3','4'],
    'Name':['srikanth','navs','chinni','pappa'],
    'Marks':[85,90,89,92]
}
df=pd.DataFrame(data)

# convert 'ID' to numeric
df['ID']=pd.to_numeric(df['ID'])

# applying functions
df['Marks']=df['Marks'].apply(lambda x:x+5)
print("After adding 5 marks to each student:")
print(df)

After adding 5 marks to each student:
   ID      Name  Marks
0   1  srikanth     90
1   2      navs     95
2   3    chinni     94
3   4     pappa     97

In [21]:
df['Marks_Normalized']=(df['Marks']-df['Marks'].min())/(df['Marks'].max()-df['Marks'].min())
print(df)

   ID      Name  Marks  Marks_Normalized
0   1  srikanth     90          0.000000
1   2      navs     95          0.714286
2   3    chinni     94          0.571429
3   4     pappa     97          1.000000

In [22]:
import pandas as pd
students=pd.DataFrame({
    'Student_ID':[101,102,103,104],
    'Name':['Ravi','Neha','Kiran','Sita']
})
#Marks Data
marks=pd.DataFrame({
    'Student_ID':[101,102,103,105],
    'Marks':[85,90,78,88]
})
merged_df=pd.merge(students,marks,on='Student_ID')
print(merged_df)

   Student_ID   Name  Marks
0         101   Ravi     85
1         102   Neha     90
2         103  Kiran     78

In [23]:
#Inner join
inner=pd.merge(students,marks,on='Student_ID',how='inner')
print(inner)
#left join
left=pd.merge(students,marks,on='Student_ID',how='left')
print(left)
#right join
right=pd.merge(students,marks,on='Student_ID',how='right')
print(right)
#outer join
outer=pd.merge(students,marks,on='Student_ID',how='outer')
print(outer)

   Student_ID   Name  Marks
0         101   Ravi     85
1         102   Neha     90
2         103  Kiran     78
   Student_ID   Name  Marks
0         101   Ravi   85.0
1         102   Neha   90.0
2         103  Kiran   78.0
3         104   Sita    NaN
   Student_ID   Name  Marks
0         101   Ravi     85
1         102   Neha     90
2         103  Kiran     78
3         105    NaN     88
   Student_ID   Name  Marks
0         101   Ravi   85.0
1         102   Neha   90.0
2         103  Kiran   78.0
3         104   Sita    NaN
4         105    NaN   88.0